[
  {
    "topic": "1. RBI Monetary Policy Review – July 2025",
    "subtopics": [
      {
        "subtopic": "Repo rate decision",
        "content": "• The Reserve Bank of India (RBI) decided to maintain the **repo rate at 6.50%** in its July 2025 monetary policy meeting.\n• This decision aligns with the central bank's focus on monitoring inflation trends and ensuring economic stability.\n• The unchanged rate indicates a cautious approach, as the RBI continues to balance growth imperatives with price stability concerns."
      }
    ]
  },
  {
    "topic": "2. SBI Launches AI-Powered Loan Processing",
    "subtopics": [
      {
        "subtopic": "New technology initiative",
        "content": "• The **State Bank of India (SBI)** has launched a new AI-powered loan processing system to streamline its operations.\n• This innovative technology is designed to significantly reduce the time taken for loan approvals, with an estimated **40% reduction** in processing time.\n• The initiative aims to improve customer experience, increase efficiency, and leverage artificial intelligence to enhance risk assessment."
      }
    ]
  },
  {
    "topic": "3. HDFC Bank Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "Quarterly financial performance",
        "content": "• HDFC Bank announced its financial results for the first quarter of fiscal year 2026 (Q1 FY26).\n• The bank reported a strong performance with a **net profit of ₹14,520 crore**, marking a notable **16% increase** compared to the same period last year.\n• This growth was primarily driven by a robust increase in net interest income and a healthy credit growth across various segments."
      }
    ]
  },
  {
    "topic": "4. LIC Increases Stake in ITC",
    "subtopics": [
      {
        "subtopic": "Investment update",
        "content": "• The **Life Insurance Corporation of India (LIC)** has raised its shareholding in the conglomerate ITC Ltd.\n• In July 2025, LIC's stake in ITC increased to **10.2%**.\n• This strategic move highlights LIC's continued confidence in ITC's long-term business prospects and its position in the Indian market."
      }
    ]
  },
  {
    "topic": "5. RBI Approves Digital Rupee Expansion",
    "subtopics": [
      {
        "subtopic": "CBDC pilot program",
        "content": "• The RBI has given the green light for the expansion of its Central Bank Digital Currency (CBDC) pilot program, known as the **Digital Rupee**.\n• The expansion allows more private sector banks to participate in the project.\n• This initiative aims to accelerate the adoption and testing of the Digital Rupee, paving the way for a more widespread rollout in the future."
      }
    ]
  },
  {
    "topic": "6. Paytm Launches UPI International Payments",
    "subtopics": [
      {
        "subtopic": "Cross-border payments",
        "content": "• Fintech major **Paytm** has introduced a new feature enabling UPI-based international payments.\n• The service has been launched in the **UAE and Singapore**, allowing Indian users to make payments via UPI in these countries.\n• This development is a significant step towards facilitating seamless cross-border transactions and promoting the global acceptance of the UPI platform."
      }
    ]
  },
  {
    "topic": "7. Adani Green Secures $1.2 Billion Funding",
    "subtopics": [
      {
        "subtopic": "Green finance deal",
        "content": "• **Adani Green Energy** has successfully secured a funding of **$1.2 billion** from a consortium of global investors.\n• The funding will be used to finance the company's renewable energy projects, including solar and wind power initiatives.\n• This deal underscores the growing international interest in India's green energy sector and supports the country's transition towards sustainable power."
      }
    ]
  },
  {
    "topic": "8. BSE Sensex Hits Record High",
    "subtopics": [
      {
        "subtopic": "Stock market milestone",
        "content": "• The **BSE Sensex**, India's benchmark stock market index, achieved a historic milestone in July 2025.\n• For the first time ever, the Sensex crossed the **80,000 mark**, reaching an all-time high on July 15, 2025.\n• This record-breaking performance reflects positive market sentiment, strong corporate earnings, and sustained foreign institutional investor inflows."
      }
    ]
  },
  {
    "topic": "9. RBI Fines ICICI Bank",
    "subtopics": [
      {
        "subtopic": "Regulatory penalty",
        "content": "• The RBI has imposed a **penalty of ₹3.5 crore** on ICICI Bank.\n• The fine was levied for the bank's non-compliance with certain regulatory guidelines, specifically related to **Know Your Customer (KYC)** norms.\n• This action emphasizes the RBI's stringent stance on regulatory compliance and its commitment to maintaining the integrity of the banking system."
      }
    ]
  },
  {
    "topic": "10. India Signs FTA with UK",
    "subtopics": [
      {
        "subtopic": "Trade agreement",
        "content": "• India and the United Kingdom have officially signed a **Free Trade Agreement (FTA)**.\n• The agreement is designed to significantly boost bilateral trade between the two nations.\n• The goal is to increase trade volume to an ambitious **$100 billion**, which would create new opportunities for businesses and foster economic growth."
      }
    ]
  },
  {
    "topic": "11. Axis Bank Partners with NPCI for Credit on UPI",
    "subtopics": [
      {
        "subtopic": "UPI innovation",
        "content": "• **Axis Bank** has collaborated with the **National Payments Corporation of India (NPCI)** to introduce a new feature for its customers.\n• The partnership has led to the launch of **RuPay Credit Card integration with UPI**, allowing users to make UPI payments directly from their credit card accounts.\n• This innovation simplifies the payment process and expands the use of credit cards in the digital payment ecosystem."
      }
    ]
  },
  {
    "topic": "12. GST Collection July 2025",
    "subtopics": [
      {
        "subtopic": "Revenue update",
        "content": "• The Goods and Services Tax (GST) revenue collection for July 2025 reached a new high.\n• The total revenue collected stood at **₹1.71 lakh crore**, making it the highest monthly collection recorded so far in 2025.\n• This strong performance indicates a healthy economic recovery and improved compliance among taxpayers."
      }
    ]
  },
  {
    "topic": "13. RBI Launches Financial Literacy Drive",
    "subtopics": [
      {
        "subtopic": "Consumer awareness",
        "content": "• The RBI has initiated a new public awareness campaign titled **'Finance for All'**.\n• The primary objective of this drive is to promote and enhance **digital banking literacy** among the general public.\n• The campaign aims to empower citizens with the knowledge and skills needed to use digital financial services safely and effectively, thereby fostering greater financial inclusion."
      }
    ]
  },
  {
    "topic": "14. Amazon India Opens Largest Fulfilment Center",
    "subtopics": [
      {
        "subtopic": "E-commerce expansion",
        "content": "• E-commerce giant **Amazon India** has inaugurated its largest fulfilment center in the country.\n• The new facility is located in **Hyderabad** and was opened in July 2025.\n• This expansion is part of Amazon's strategy to strengthen its logistics network, reduce delivery times, and better serve its growing customer base in India."
      }
    ]
  },
  {
    "topic": "15. Mutual Fund AUM Reaches Record High",
    "subtopics": [
      {
        "subtopic": "Investment milestone",
        "content": "• The Indian mutual fund industry has achieved a significant milestone in July 2025.\n• The total **Assets Under Management (AUM)** of the industry crossed the **₹55 lakh crore** mark for the first time.\n• This record high AUM reflects growing investor confidence and the increasing popularity of mutual funds as a preferred investment avenue."
      }
    ]
  },
  {
    "topic": "16. RBI Introduces Green Deposit Framework",
    "subtopics": [
      {
        "subtopic": "Sustainable banking",
        "content": "• The RBI has unveiled a new framework specifically for **green deposits**.\n• The framework mandates that banks must disclose how the proceeds from these deposits are being used.\n• This regulatory step is aimed at promoting sustainable banking practices and ensuring transparency in the allocation of funds towards environmentally friendly projects."
      }
    ]
  },
  {
    "topic": "17. PhonePe Acquires ZestMoney Assets",
    "subtopics": [
      {
        "subtopic": "Fintech acquisition",
        "content": "• Fintech company **PhonePe** has completed the acquisition of key assets of **ZestMoney**.\n• This strategic acquisition is intended to bolster PhonePe's presence in the **Buy Now, Pay Later (BNPL)** segment.\n• The move will allow PhonePe to leverage ZestMoney's technology and customer base to expand its offerings in the credit and lending space."
      }
    ]
  },
  {
    "topic": "18. World Bank Approves Loan for MSME Growth",
    "subtopics": [
      {
        "subtopic": "International funding",
        "content": "• The **World Bank** has approved a **$500 million loan** to support India's Micro, Small, and Medium Enterprises (MSMEs).\n• The funding is specifically allocated to initiatives that will boost the competitiveness and resilience of MSMEs.\n• This loan is expected to facilitate access to finance and technology, helping small businesses grow and contribute to economic development."
      }
    ]
  },
  {
    "topic": "19. Reliance Retail Buys Majority Stake in Coffee Chain",
    "subtopics": [
      {
        "subtopic": "Business expansion",
        "content": "• **Reliance Retail Ventures Ltd.** has announced a significant acquisition in the food and beverage sector.\n• The company has acquired a **70% majority stake** in the popular coffee chain **Blue Cup Coffee** for **₹850 crore**.\n• This move is part of Reliance Retail's broader strategy to expand its presence in the quick-service restaurant and cafe market."
      }
    ]
  },
  {
    "topic": "20. RBI Revises Priority Sector Lending Norms",
    "subtopics": [
      {
        "subtopic": "Bank lending rules",
        "content": "• The RBI has revised the norms for **Priority Sector Lending (PSL)**.\n• The revised rules have increased the loan target for **renewable energy projects** from the existing **₹30 crore to ₹50 crore**.\n• This change is aimed at encouraging banks to lend more to the renewable energy sector, thereby supporting India's clean energy goals."
      }
    ]
  },
  {
    "topic": "21. India’s Forex Reserves Hit Record Level",
    "subtopics": [
      {
        "subtopic": "External sector update",
        "content": "• India's foreign exchange reserves have reached an all-time high in July 2025.\n• The reserves touched a new record of **$690 billion**, reflecting a strong and stable external sector.\n• This increase is attributed to a positive balance of payments and consistent capital inflows."
      }
    ]
  },
  {
    "topic": "22. RBI Introduces Framework for Digital Lending Apps",
    "subtopics": [
      {
        "subtopic": "Consumer protection",
        "content": "• To protect consumers from predatory practices, the RBI has issued a new regulatory framework for **digital lending apps**.\n• The new rules aim to regulate the online lending space, ensuring greater transparency and fair practices.\n• The framework addresses concerns regarding high-interest rates, lack of transparency, and recovery methods used by some digital lenders."
      }
    ]
  },
  {
    "topic": "23. Tata Motors Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "Automobile sector performance",
        "content": "• **Tata Motors** announced its financial results for Q1 FY26, showcasing a strong performance.\n• The company posted a consolidated **net profit of ₹4,200 crore**, a significant improvement from the previous year.\n• The profit growth was largely fueled by robust sales in the electric vehicle (EV) segment and improved demand for its commercial and passenger vehicles."
      }
    ]
  },
  {
    "topic": "24. India Overtakes UK as World’s 5th Largest Stock Market",
    "subtopics": [
      {
        "subtopic": "Global markets ranking",
        "content": "• India has surpassed the United Kingdom to become the **world's fifth-largest stock market** by market capitalization.\n• The total market capitalization of all listed companies in India reached **$5.1 trillion**.\n• This achievement is a testament to the strong performance of the Indian economy and the growing confidence of investors in its market."
      }
    ]
  },
  {
    "topic": "25. RBI Enhances UPI Transaction Limits",
    "subtopics": [
      {
        "subtopic": "Payment system update",
        "content": "• The RBI has raised the Unified Payments Interface (UPI) transaction limits for specific categories.\n• The new limit for payments made to **hospitals and educational institutions** has been increased to **₹5 lakh**.\n• This move aims to facilitate larger value transactions for essential services and further promote the use of UPI."
      }
    ]
  },
  {
    "topic": "26. IMF Raises India’s GDP Growth Forecast",
    "subtopics": [
      {
        "subtopic": "Economic outlook",
        "content": "• The **International Monetary Fund (IMF)** has revised its economic forecast for India for the year 2025.\n• The IMF's new projection for India's GDP growth is **6.9%**, an increase from the earlier forecast of 6.7%.\n• This upward revision reflects a positive outlook on the Indian economy, driven by strong domestic demand and government-led reforms."
      }
    ]
  },
  {
    "topic": "27. NPCI Launches UPI Tap & Pay",
    "subtopics": [
      {
        "subtopic": "Contactless payments",
        "content": "• The NPCI has introduced a new feature called **UPI Tap & Pay**.\n• This contactless payment system allows users to make quick and easy payments by simply tapping their phones at Point of Sale (POS) machines.\n• The technology is aimed at providing a faster and more convenient alternative to traditional QR code scanning for UPI transactions."
      }
    ]
  },
  {
    "topic": "28. India’s Merchandise Exports Rise in July 2025",
    "subtopics": [
      {
        "subtopic": "Trade data update",
        "content": "• India's merchandise exports showed a positive growth trend in July 2025.\n• Exports grew by **8.2%** year-on-year, reaching a total value of **$39.5 billion**.\n• This increase is a result of improved global demand and government initiatives to boost exports across various sectors."
      }
    ]
  },
  {
    "topic": "29. RBI Cancels License of Urban Co-operative Bank",
    "subtopics": [
      {
        "subtopic": "Banking regulation",
        "content": "• The RBI has taken regulatory action by cancelling the license of a specific urban co-operative bank.\n• The license of **XYZ Urban Co-operative Bank** was revoked due to its precarious financial position and inability to meet regulatory requirements.\n• This decision was made to protect the interests of depositors, as the bank was deemed insolvent."
      }
    ]
  },
  {
    "topic": "30. Amazon Pay Ties Up with IRCTC",
    "subtopics": [
      {
        "subtopic": "Travel payments",
        "content": "• **Amazon Pay**, the digital payment arm of Amazon, has announced a new partnership with the **Indian Railway Catering and Tourism Corporation (IRCTC)**.\n• The collaboration allows users to seamlessly book train tickets on the IRCTC platform using Amazon Pay.\n• This integration provides a convenient and secure payment option, enhancing the user experience for millions of railway passengers."
      }
    ]
  },
  {
    "topic": "31. EPFO Increases Interest Rate",
    "subtopics": [
      {
        "subtopic": "Provident fund returns",
        "content": "• The **Employees' Provident Fund Organisation (EPFO)** has approved an increase in the interest rate for its members.\n• The interest rate on provident fund deposits for the fiscal year 2026 (FY26) has been raised to **8.25%**.\n• This move benefits millions of salaried employees and is a result of the organization's healthy financial performance."
      }
    ]
  },
  {
    "topic": "32. India’s CPI Inflation – July 2025",
    "subtopics": [
      {
        "subtopic": "Inflation data",
        "content": "• India's **Consumer Price Index (CPI)** inflation for July 2025 has shown a positive trend.\n• The inflation rate eased to **4.8%**, which is well within the RBI's comfort zone and its target range.\n• The decline in inflation is attributed to a softening in food prices and stable fuel costs."
      }
    ]
  },
  {
    "topic": "33. Flipkart Launches Digital Gold Loans",
    "subtopics": [
      {
        "subtopic": "Fintech innovation",
        "content": "• E-commerce major **Flipkart** has ventured into the fintech space with the launch of a new service.\n• The company has partnered with several banks to offer **digital gold loans** directly through its mobile application.\n• This service allows customers to leverage their digital gold holdings to avail of loans, providing a convenient and accessible financing option."
      }
    ]
  },
  {
    "topic": "34. SEBI Introduces T+0 Settlement Pilot",
    "subtopics": [
      {
        "subtopic": "Stock market reform",
        "content": "• The **Securities and Exchange Board of India (SEBI)** has announced a significant reform in the stock market.\n• SEBI is launching a pilot program for **T+0 settlement**, which means trades will be settled on the same day they are executed.\n• This initiative, initially for a select group of securities, aims to improve market efficiency and reduce settlement risks."
      }
    ]
  },
  {
    "topic": "35. NHAI Raises $500 Million via Green Bonds",
    "subtopics": [
      {
        "subtopic": "Infrastructure financing",
        "content": "• The **National Highways Authority of India (NHAI)** has successfully raised **$500 million** through the issuance of its first-ever **green bonds**.\n• The funds raised from these bonds will be specifically utilized to finance environmentally friendly highway projects.\n• This move highlights NHAI's commitment to sustainable infrastructure development and attracting green financing."
      }
    ]
  },
  {
    "topic": "36. India’s Services PMI – July 2025",
    "subtopics": [
      {
        "subtopic": "Economic indicator",
        "content": "• The **Services Purchasing Managers' Index (PMI)** for India in July 2025 indicates a strong performance.\n• The index stood at **58.7**, a figure well above the 50-mark that separates expansion from contraction.\n• This robust reading suggests that the services sector continues to expand at a healthy pace, driven by new business and positive economic sentiment."
      }
    ]
  },
  {
    "topic": "37. RBI Approves Merger of Two Private Banks",
    "subtopics": [
      {
        "subtopic": "Banking consolidation",
        "content": "• The RBI has granted its approval for the merger of two private sector banks.\n• The merger will see **South Indian Bank** and **Karnataka Bank** consolidate their operations to form a larger and more resilient entity.\n• This consolidation is expected to create a stronger bank with a broader network and enhanced financial capabilities."
      }
    ]
  },
  {
    "topic": "38. India’s Current Account Deficit Narrows",
    "subtopics": [
      {
        "subtopic": "External sector improvement",
        "content": "• India's **Current Account Deficit (CAD)** has shown a positive trend, narrowing significantly in the first quarter of FY26.\n• The CAD narrowed to **1.1% of GDP**, a notable improvement from previous quarters.\n• This improvement is a result of a healthy growth in services exports and a contained merchandise trade deficit."
      }
    ]
  },
  {
    "topic": "39. HDFC Life Launches AI Chatbot for Policyholders",
    "subtopics": [
      {
        "subtopic": "Customer service upgrade",
        "content": "• **HDFC Life** has launched a new customer service initiative powered by artificial intelligence.\n• The company has introduced an **AI-powered chatbot named 'Jeevan'** to provide instant support and query resolution to its policyholders.\n• This chatbot is designed to enhance customer experience, offering quick and efficient assistance with policy-related information and claims."
      }
    ]
  },
  {
    "topic": "40. India Attracts Record FDI in July 2025",
    "subtopics": [
      {
        "subtopic": "Investment inflows",
        "content": "• India has attracted a record level of **Foreign Direct Investment (FDI)** in July 2025.\n• The total FDI inflows for the month amounted to **$8.3 billion**, marking the highest monthly inflow in the last two years.\n• This strong inflow of foreign investment reflects the country's attractiveness as a global investment destination and confidence in its economic policies."
      }
    ]
  },
  {
    "topic": "41. NPCI Introduces Offline UPI Payments",
    "subtopics": [
      {
        "subtopic": "Payment innovation",
        "content": "• The National Payments Corporation of India (NPCI) has launched a new feature for the Unified Payments Interface (UPI).\n• The feature allows for **offline UPI payments** using a pre-registered PIN, without requiring an active internet connection.\n• This is a major step towards enhancing financial inclusion in rural and remote areas with limited network connectivity."
      }
    ]
  },
  {
    "topic": "42. ONGC Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "Oil and gas sector performance",
        "content": "• The Oil and Natural Gas Corporation (ONGC) announced its Q1 FY26 results.\n• The company reported a net profit of **₹12,500 crore**, driven by stable crude oil prices and increased production from key fields.\n• The results reflect a healthy recovery in the energy sector and efficient operational management."
      }
    ]
  },
  {
    "topic": "43. India’s Trade Deficit Narrows",
    "subtopics": [
      {
        "subtopic": "International trade",
        "content": "• India's merchandise trade deficit narrowed to **$19.5 billion** in July 2025.\n• This improvement is a result of a strong growth in exports combined with a moderation in the import bill.\n• The narrowing deficit provides stability to the country's external finances and currency."
      }
    ]
  },
  {
    "topic": "44. Bank of India Launches Digital FD Platform",
    "subtopics": [
      {
        "subtopic": "Digital banking",
        "content": "• **Bank of India** has launched a new digital platform for fixed deposits (FDs).\n• The platform allows customers to open FDs completely online in just a few minutes, without the need for any physical paperwork.\n• This initiative is part of the bank's digital transformation strategy to provide a seamless and paperless banking experience."
      }
    ]
  },
  {
    "topic": "45. India’s Industrial Production Rebounds",
    "subtopics": [
      {
        "subtopic": "Economic indicator",
        "content": "• India's **Index of Industrial Production (IIP)** grew by **7.8%** in July 2025.\n• The strong growth was led by a rebound in the manufacturing and electricity sectors.\n• This indicates a broad-based recovery in industrial activity and business confidence."
      }
    ]
  },
  {
    "topic": "46. SEBI Amends Rules for FPIs",
    "subtopics": [
      {
        "subtopic": "Regulatory changes",
        "content": "• The Securities and Exchange Board of India (SEBI) has amended the rules for **Foreign Portfolio Investors (FPIs)**.\n• The new rules aim to simplify the registration process and ease compliance for FPIs.\n• The changes are intended to attract more foreign capital into the Indian stock market."
      }
    ]
  },
  {
    "topic": "47. Flipkart Introduces Voice-Enabled Shopping",
    "subtopics": [
      {
        "subtopic": "E-commerce innovation",
        "content": "• Flipkart has launched a new feature that enables **voice-enabled shopping** on its platform.\n• Customers can now use voice commands to search for products, add them to their cart, and complete the purchase.\n• This technology is designed to make online shopping more accessible and convenient for a wider range of users, especially in Tier 2 and Tier 3 cities."
      }
    ]
  },
  {
    "topic": "48. India’s Services Exports Continue to Grow",
    "subtopics": [
      {
        "subtopic": "Trade data update",
        "content": "• India's services exports saw a continued increase in July 2025, reaching **$28.5 billion**.\n• The growth was primarily driven by strong demand for IT, business, and financial services from global markets.\n• This sustained performance helps to narrow the country's overall current account deficit."
      }
    ]
  },
  {
    "topic": "49. RBI to Issue New ₹200 Banknotes",
    "subtopics": [
      {
        "subtopic": "Currency update",
        "content": "• The Reserve Bank of India (RBI) has announced its decision to issue new series of **₹200 banknotes**.\n• The new notes will feature enhanced security features and a revised design, in line with modern currency standards.\n• This move is part of the RBI's strategy to combat counterfeiting and improve the security of Indian currency."
      }
    ]
  },
  {
    "topic": "50. Tata Power Secures Major Solar Project",
    "subtopics": [
      {
        "subtopic": "Renewable energy deal",
        "content": "• **Tata Power** has secured a major contract to develop a **500 MW solar power project** in Rajasthan.\n• The project, valued at **₹2,500 crore**, is a significant addition to the company's renewable energy portfolio.\n• This win reinforces Tata Power's leadership in India's solar energy sector and contributes to the country's clean energy targets."
      }
    ]
  },
  {
    "topic": "51. Adani Ports Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "Logistics and infrastructure performance",
        "content": "• **Adani Ports & SEZ** reported a net profit of **₹1,850 crore** for the first quarter of FY26.\n• The profit growth was driven by a significant increase in cargo volume and improved operational efficiency.\n• The results highlight the company's strong position in India's port and logistics sector."
      }
    ]
  },
  {
    "topic": "52. India’s Digital Payments Value Crosses ₹1 Trillion",
    "subtopics": [
      {
        "subtopic": "Fintech milestone",
        "content": "• The total value of digital payment transactions in India crossed the **₹1 trillion** mark in July 2025.\n• This milestone reflects the massive adoption of digital payment methods like UPI, mobile wallets, and internet banking.\n• The growth is supported by government initiatives and the widespread use of smartphones."
      }
    ]
  },
  {
    "topic": "53. IDBI Bank Launches Kisan Credit Card on UPI",
    "subtopics": [
      {
        "subtopic": "Financial inclusion",
        "content": "• **IDBI Bank** has partnered with the NPCI to launch a **Kisan Credit Card (KCC) on the UPI platform**.\n• This initiative allows farmers to access their credit limits through UPI, facilitating digital transactions for agricultural needs.\n• The move is aimed at digitizing rural finance and promoting financial inclusion among the farming community."
      }
    ]
  },
  {
    "topic": "54. IndiGo Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "Aviation sector performance",
        "content": "• **IndiGo** reported a net profit of **₹3,200 crore** for Q1 FY26, a record-breaking performance for the airline.\n• The profit was driven by high passenger traffic, strong load factors, and a decline in fuel prices.\n• The results signal a robust recovery and growth in India's aviation sector."
      }
    ]
  },
  {
    "topic": "55. RBI to Introduce New Framework for NBFCs",
    "subtopics": [
      {
        "subtopic": "Regulatory changes",
        "content": "• The RBI is set to introduce a new regulatory framework for **Non-Banking Financial Companies (NBFCs)**.\n• The framework will introduce stricter governance norms and capital adequacy requirements for large NBFCs.\n• The aim is to strengthen the financial stability of the NBFC sector and protect consumer interests."
      }
    ]
  },
  {
    "topic": "56. India’s Unemployment Rate Decreases",
    "subtopics": [
      {
        "subtopic": "Labor market data",
        "content": "• India’s unemployment rate in July 2025 decreased to **7.2%** from 7.8% in the previous month.\n• The decline is attributed to a rise in employment opportunities in both the urban and rural sectors.\n• The data indicates a positive trend in the labor market and job creation."
      }
    ]
  },
  {
    "topic": "57. Kotak Mahindra Bank Partners with Startups for Fintech Solutions",
    "subtopics": [
      {
        "subtopic": "Banking innovation",
        "content": "• **Kotak Mahindra Bank** has launched a new accelerator program to partner with fintech startups.\n• The initiative aims to co-develop innovative banking and financial solutions using emerging technologies like AI and blockchain.\n• This collaboration will help the bank stay at the forefront of digital innovation in the financial sector."
      }
    ]
  },
  {
    "topic": "58. India-Australia Sign ECTA Phase 2",
    "subtopics": [
      {
        "subtopic": "Trade agreement",
        "content": "• India and Australia signed the second phase of the **Economic Cooperation and Trade Agreement (ECTA)**.\n• This phase expands the scope of the agreement to include services and investment, in addition to goods.\n• The deal is expected to further boost bilateral trade and economic ties between the two countries."
      }
    ]
  },
  {
    "topic": "59. Wipro Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "IT sector performance",
        "content": "• **Wipro** announced a consolidated net profit of **₹3,800 crore** for Q1 FY26.\n• The results were driven by a strong growth in its cloud services and digital transformation business.\n• This performance highlights the continued demand for IT services and solutions."
      }
    ]
  },
  {
    "topic": "60. RBI Mandates Two-Factor Authentication for All Online Transactions",
    "subtopics": [
      {
        "subtopic": "Cybersecurity and consumer safety",
        "content": "• The RBI has mandated **two-factor authentication (2FA)** for all online transactions above a certain threshold.\n• This new rule is aimed at enhancing the security of digital payments and protecting consumers from fraud.\n• The mandate applies to a wide range of online transactions, including credit card and debit card payments."
      }
    ]
  },
  {
    "topic": "61. Tata Steel Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "Manufacturing sector performance",
        "content": "• **Tata Steel** reported a consolidated net profit of **₹6,100 crore** in Q1 FY26.\n• The profit growth was supported by strong domestic demand and stable steel prices.\n• The results reflect a healthy performance in the steel and manufacturing sector."
      }
    ]
  },
  {
    "topic": "62. India’s E-Mobility Market Attracts $10 Billion FDI",
    "subtopics": [
      {
        "subtopic": "Investment and green technology",
        "content": "• India's burgeoning **e-mobility market** attracted a record **$10 billion in Foreign Direct Investment (FDI)** in the first half of 2025.\n• The investments are primarily focused on electric vehicle (EV) manufacturing, battery production, and charging infrastructure.\n• This surge in investment underscores the potential of India's EV sector and the government's push for green transportation."
      }
    ]
  },
  {
    "topic": "63. SEBI to Introduce ESG Rating Framework",
    "subtopics": [
      {
        "subtopic": "Regulatory changes and sustainable finance",
        "content": "• SEBI is set to introduce a new framework for **Environmental, Social, and Governance (ESG) ratings** of companies.\n• The framework will provide standardized guidelines for rating agencies to assess companies' ESG performance.\n• This move will help investors make informed decisions and promote sustainable investing in the Indian market."
      }
    ]
  },
  {
    "topic": "64. Bank of Baroda Launches 'Baroda Digital Yatra'",
    "subtopics": [
      {
        "subtopic": "Banking initiative",
        "content": "• **Bank of Baroda** launched a new digital outreach program named **'Baroda Digital Yatra'**.\n• The initiative aims to promote digital banking services in rural and semi-urban areas through mobile banking vans and workshops.\n• The program is part of the bank's efforts to enhance digital literacy and financial inclusion across the country."
      }
    ]
  },
  {
    "topic": "65. India’s Gold Imports Decline",
    "subtopics": [
      {
        "subtopic": "Trade data update",
        "content": "• India's gold imports declined by **15%** in July 2025, compared to the same period last year.\n• The decline is attributed to a moderation in domestic demand and a rise in international gold prices.\n• This moderation in imports helps to manage the country's trade and current account deficits."
      }
    ]
  },
  {
    "topic": "66. PhonePe Launches 'PhonePe Insurance' Platform",
    "subtopics": [
      {
        "subtopic": "Fintech and insurance",
        "content": "• PhonePe has entered the insurance sector with the launch of its new platform, **'PhonePe Insurance'**.\n• The platform offers a wide range of insurance products, including health, life, and motor insurance from various partners.\n• This move is aimed at simplifying the insurance buying process and making it more accessible to its large user base."
      }
    ]
  },
  {
    "topic": "67. India’s Wheat Production Forecast Rises",
    "subtopics": [
      {
        "subtopic": "Agricultural and economic data",
        "content": "• The government has revised its forecast for India's **wheat production** for the current year.\n• The new forecast projects a record output of **115 million tonnes**, driven by favorable weather conditions and high-yield varieties.\n• This increase ensures food security and reduces the need for wheat imports."
      }
    ]
  },
  {
    "topic": "68. Reliance Industries Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "Conglomerate performance",
        "content": "• **Reliance Industries Ltd. (RIL)** reported a consolidated net profit of **₹19,500 crore** for Q1 FY26.\n• The growth was fueled by strong performance across its retail, telecom (Jio), and oil-to-chemicals (O2C) businesses.\n• The results reflect the conglomerate's diverse and resilient business model."
      }
    ]
  },
  {
    "topic": "69. RBI to Implement 'Positive Pay System' for Cheques",
    "subtopics": [
      {
        "subtopic": "Banking and fraud prevention",
        "content": "• The RBI has announced the implementation of a **'Positive Pay System'** for all cheque payments above a specific value.\n• The system requires customers to re-confirm key details of the cheque to the bank before it is presented for payment.\n• This measure is aimed at preventing cheque fraud and enhancing the security of banking transactions."
      }
    ]
  },
  {
    "topic": "70. India’s Solar Energy Capacity Crosses 100 GW",
    "subtopics": [
      {
        "subtopic": "Renewable energy milestone",
        "content": "• India's installed **solar energy capacity** crossed the **100 gigawatts (GW)** milestone in July 2025.\n• This achievement is a result of sustained government support, private sector investment, and a decline in the cost of solar technology.\n• It marks a major step towards India's clean energy goals and its commitment to the Paris Agreement."
      }
    ]
  },
  {
    "topic": "71. SBI Cards Partners with Vistara",
    "subtopics": [
      {
        "subtopic": "Co-branded credit card",
        "content": "• **SBI Cards** has launched a new co-branded credit card in partnership with airline **Vistara**.\n• The card offers exclusive benefits to travelers, including accelerated reward points on flight bookings and airport lounge access.\n• This collaboration aims to tap into the growing premium travel market."
      }
    ]
  },
  {
    "topic": "72. India’s Fiscal Deficit at 35% of FY26 Target",
    "subtopics": [
      {
        "subtopic": "Government finances",
        "content": "• India’s fiscal deficit for the first quarter of FY26 stood at **35% of the full-year target**.\n• The numbers are in line with the government's fiscal consolidation roadmap, with tax collections and revenue receipts showing healthy growth.\n• This indicates a stable fiscal position despite increased capital expenditure."
      }
    ]
  },
  {
    "topic": "73. Zomato Launches New Inter-City Food Delivery Service",
    "subtopics": [
      {
        "subtopic": "Food delivery innovation",
        "content": "• Food delivery giant **Zomato** has launched a new service for **inter-city food delivery**.\n• The service, currently in a pilot phase, allows users to order food from popular restaurants in other cities.\n• This initiative aims to tap into the premium food segment and cater to customers' cravings for authentic regional cuisines."
      }
    ]
  },
  {
    "topic": "74. India’s Sugar Exports Soar",
    "subtopics": [
      {
        "subtopic": "Agricultural trade",
        "content": "• India's **sugar exports** reached a record high in the first half of the current season.\n• The country exported over **7.5 million tonnes**, driven by high global prices and a surplus domestic production.\n• This performance is a major boost for the country's sugar industry and helps in earning valuable foreign exchange."
      }
    ]
  },
  {
    "topic": "75. RBI to Conduct Stress Tests for NBFCs",
    "subtopics": [
      {
        "subtopic": "Regulatory oversight",
        "content": "• The RBI has announced that it will conduct **stress tests for NBFCs** with large asset bases.\n• The tests will assess the resilience of NBFCs to various economic shocks and financial risks.\n• This move is a proactive step to ensure the stability of the financial system and prevent any potential contagion."
      }
    ]
  },
  {
    "topic": "76. Paytm Money Launches Robo-Advisory Platform",
    "subtopics": [
      {
        "subtopic": "Fintech and wealth management",
        "content": "• **Paytm Money**, the wealth management arm of Paytm, has launched a new **robo-advisory platform**.\n• The platform uses algorithms and AI to provide automated investment advice and portfolio management services to retail investors.\n• This service aims to democratize access to professional financial advice and simplify the investment process."
      }
    ]
  },
  {
    "topic": "77. India’s Automotive Sales Surge",
    "subtopics": [
      {
        "subtopic": "Automobile sector data",
        "content": "• India's automotive sales witnessed a significant surge in July 2025, with sales growing by **12.5%** year-on-year.\n• The growth was driven by strong demand for passenger vehicles, two-wheelers, and electric vehicles.\n• The robust sales numbers indicate a positive consumer sentiment and economic recovery."
      }
    ]
  },
  {
    "topic": "78. RBI Extends Credit Line for Co-operative Banks",
    "subtopics": [
      {
        "subtopic": "Banking support",
        "content": "• The RBI has extended a special credit line to eligible **co-operative banks** to support their liquidity requirements.\n• This facility is aimed at ensuring the smooth functioning of these banks and protecting the interests of their customers.\n• The move provides a financial safety net for co-operative banks during times of stress."
      }
    ]
  },
  {
    "topic": "79. India’s Foreign Inward Remittances Cross $120 Billion",
    "subtopics": [
      {
        "subtopic": "External sector data",
        "content": "• India's **foreign inward remittances** reached a new record, crossing **$120 billion** in the first half of 2025.\n• The high volume of remittances is a result of a strong Indian diaspora and favorable global economic conditions.\n• This inflow of funds is a major contributor to the country's foreign exchange reserves and economic stability."
      }
    ]
  },
  {
    "topic": "80. SEBI Approves Gold Exchange Framework",
    "subtopics": [
      {
        "subtopic": "Capital market development",
        "content": "• SEBI has approved the framework for a new **gold exchange** in India.\n• The exchange will facilitate the trading of electronic gold receipts (EGRs) and provide a regulated platform for gold transactions.\n• This initiative is aimed at increasing the transparency and efficiency of the gold market in India."
      }
    ]
  },
  {
    "topic": "81. HCLTech Q1 FY26 Results",
    "subtopics": [
      {
        "subtopic": "IT sector performance",
        "content": "• **HCLTech** reported a consolidated net profit of **₹4,500 crore** for Q1 FY26.\n• The company's strong performance was driven by a healthy deal pipeline and growth in its digital services portfolio.\n• The results reflect the resilience of the Indian IT sector amid global economic shifts."
      }
    ]
  },
  {
    "topic": "82. India’s Forex Reserves Reach $700 Billion Mark",
    "subtopics": [
      {
        "subtopic": "External sector milestone",
        "content": "• In a major milestone, India's foreign exchange reserves crossed the **$700 billion** mark in the last week of July 2025.\n• This record-breaking figure is a result of strong capital inflows, a stable rupee, and prudent management by the RBI.\n• The high reserves provide a strong buffer against external shocks and boost investor confidence."
      }
    ]
  },
  {
    "topic": "83. Yes Bank Partners with Amazon for Business Banking",
    "subtopics": [
      {
        "subtopic": "Digital banking and e-commerce",
        "content": "• **Yes Bank** has announced a partnership with **Amazon** to provide a suite of business banking solutions to Amazon's sellers.\n• The collaboration will offer sellers easy access to working capital loans, digital payment solutions, and other banking services.\n• This initiative is aimed at supporting the growth of small and medium businesses on the e-commerce platform."
      }
    ]
  },
  {
    "topic": "84. India’s Manufacturing PMI Reaches 3-Year High",
    "subtopics": [
      {
        "subtopic": "Economic indicator",
        "content": "• The **Manufacturing Purchasing Managers' Index (PMI)** for India hit a 3-year high of **59.2** in July 2025.\n• The strong reading indicates a robust expansion in the manufacturing sector, with new orders and production growing at a fast pace.\n• This performance is a positive sign for India's economic recovery and industrial growth."
      }
    ]
  },
  {
    "topic": "85. RBI to Launch Pilot for Interbank Lending on Blockchain",
    "subtopics": [
      {
        "subtopic": "Technology innovation",
        "content": "• The RBI is set to launch a pilot program for **interbank lending using blockchain technology**.\n• The project aims to test the potential of blockchain to make interbank transactions faster, more secure, and transparent.\n• This is a key step towards modernizing India's financial infrastructure with cutting-edge technology."
      }
    ]
  },
  {
    "topic": "86. India’s Non-oil Imports Decline",
    "subtopics": [
      {
        "subtopic": "International trade",
        "content": "• India's non-oil imports showed a decline in July 2025, which helped to further narrow the trade deficit.\n• The decline is attributed to a mix of lower commodity prices and a focus on domestic production.\n• This trend is favorable for the country's balance of payments."
      }
    ]
  },
  {
    "topic": "87. SEBI Introduces 'Fast-Track' IPO Process",
    "subtopics": [
      {
        "subtopic": "Capital market reform",
        "content": "• SEBI has introduced a **'fast-track' IPO process** for companies with a strong track record and robust financials.\n• The new process will reduce the time taken for companies to go public, making the Indian capital market more attractive for high-growth firms.\n• This reform is aimed at streamlining the IPO process and boosting market dynamism."
      }
    ]
  },
  {
    "topic": "88. India's FDI in Manufacturing Sector Surges",
    "subtopics": [
      {
        "subtopic": "Investment and industrial growth",
        "content": "• The manufacturing sector in India witnessed a surge in **FDI inflows** in July 2025.\n• The investments were concentrated in key sectors like electronics, automobiles, and pharmaceuticals.\n• This trend is a positive outcome of the government's 'Make in India' initiative and production-linked incentive schemes."
      }
    ]
  },
  {
    "topic": "89. HDFC Bank Launches Virtual Credit Card",
    "subtopics": [
      {
        "subtopic": "Digital banking innovation",
        "content": "• HDFC Bank has launched a new **virtual credit card** for its customers.\n• The card is a digital-only offering that can be used for online transactions and is linked to the customer's existing HDFC Bank account.\n• This product is designed to provide a secure and convenient payment option in the digital age."
      }
    ]
  },
  {
    "topic": "90. India’s Consumer Durables Sales See Strong Growth",
    "subtopics": [
      {
        "subtopic": "Consumer sector data",
        "content": "• The sales of consumer durables in India showed a strong growth trend in July 2025.\n• The growth was driven by festive season demand and a rise in disposable incomes.\n• This indicates a positive consumer sentiment and a healthy domestic market."
      }
    ]
  }
]
