[
  {
    "topic": "1. India’s Services PMI Hits 11-Month High – July 2025",
    "subtopics": [
      {
        "subtopic": "Sector performance",
        "content": "• HSBC India Services PMI rose to 60.5 in July from 60.4 in June – the highest level since August 2024. :contentReference[oaicite:0]{index=0}\n• Growth driven by strong export orders and domestic sales, especially from finance and insurance sectors. :contentReference[oaicite:1]{index=1}\n• Despite expansion, hiring slowed to a 15-month low, and price pressures rose, with input costs exceeding material gains. :contentReference[oaicite:2]{index=2}\n• Composite PMI (services + manufacturing) climbed to 61.1 — fastest pace since April 2024. :contentReference[oaicite:3]{index=3}"
      }
    ]
  },
  {
    "topic": "2. India’s Manufacturing PMI Sees 17-Year High – July 2025",
    "subtopics": [
      {
        "subtopic": "Industrial output",
        "content": "• HSBC India Manufacturing PMI jumped to 59.2 in July, marking the highest level in 17 years. :contentReference[oaicite:4]{index=4}\n• Private sector composite PMI (manufacturing + services) stayed strong at 60.7, indicating sustained expansion. :contentReference[oaicite:5]{index=5}"
      }
    ]
  },
  {
    "topic": "3. RBI Retail Digital Rupee Pilot – Banks & Coverage",
    "subtopics": [
      {
        "subtopic": "CBDC rollout data",
        "content": "• As of March 2025, the retail digital rupee pilot (e₹-R) expanded to 17 banks and 6 million users, with circulation hitting ₹1,016 crore (up from ₹234 crore a year earlier). :contentReference[oaicite:6]{index=6}\n• RBI is exploring CBDC cross-border pilots for faster, more transparent international settlements. :contentReference[oaicite:7]{index=7}"
      }
    ]
  },
  {
    "topic": "4. RBI CBDC-R Pilot Cities Covered",
    "subtopics": [
      {
        "subtopic": "Geographic rollout",
        "content": "• Phase-1 (Dec 2022) covered Mumbai, New Delhi, Bengaluru, and Bhubaneswar with SBI, ICICI, Yes Bank & IDFC First Bank. :contentReference[oaicite:8]{index=8}\n• Phase-2 added Ahmedabad, Gangtok, Guwahati, Hyderabad, Indore, Kochi, Lucknow, Patna, and Shimla via BOB, UBI, HDFC, and Kotak Bank. :contentReference[oaicite:9]{index=9}"
      }
    ]
  },
  {
    "topic": "5. RBI CBDC Pilot – Banks Offering Digital Rupee Wallets",
    "subtopics": [
      {
        "subtopic": "Bank participation",
        "content": "• As per RBI, 15 banks currently offer retail digital rupee wallets: SBI, ICICI, IDFC First, Yes Bank, HDFC Bank, Union Bank, BOB, Kotak, Canara Bank, Axis, IndusInd, PNB, Federal Bank, Karnataka Bank, Indian Bank, and IDBI. :contentReference[oaicite:10]{index=10}"
      }
    ]
  },
  {
    "topic": "6. Rapid CBDC-R Adoption & Programmability",
    "subtopics": [
      {
        "subtopic": "Usage trends",
        "content": "• By March 2025, adoption reached 6 million users across 17 banks, ₹1,016 crore circulation. :contentReference[oaicite:11]{index=11}\n• CBDC now supports offline use and programmable features — e.g., welfare transfers and carbon-credit payments. :contentReference[oaicite:12]{index=12}"
      }
    ]
  },
  {
    "topic": "7. India’s Services PMI & Composite PMI Growth",
    "subtopics": [
      {
        "subtopic": "Momentum drivers",
        "content": "• Service sector growth (PMI 60.5) bolstered by export orders, digital marketing, insurance & finance demand. :contentReference[oaicite:13]{index=13}\n• Composite PMI at 61.1 — strongest since April 2024. :contentReference[oaicite:14]{index=14}\n• Hiring slowed; inflationary pressures rise — likely considerations for RBI’s policy decisions ahead. :contentReference[oaicite:15]{index=15}"
      }
    ]
  },
  {
    "topic": "8. RBI Exploring CBDC Cross-Border Projects",
    "subtopics": [
      {
        "subtopic": "Global use cases",
        "content": "• RBI is developing cross-border CBDC pilots, both bilateral and multilateral, to enhance payment efficiency and transparency. :contentReference[oaicite:16]{index=16}\n• These are in advanced planning stages with technical frameworks being finalized. :contentReference[oaicite:17]{index=17}"
      }
    ]
  },
  {
    "topic": "9. Manufacturing PMI Nearly Hits 60 – July 2025",
    "subtopics": [
      {
        "subtopic": "Industrial demand",
        "content": "• HSBC Manufacturing PMI reached 59.1 in July, signaling strong growth in industrial output. :contentReference[oaicite:18]{index=18}"
      }
    ]
  },
  {
    "topic": "10. Composite PMI Reflects Overall Economic Expansion",
    "subtopics": [
      {
        "subtopic": "Pulse of private sector",
        "content": "• The HSBC India Composite PMI rose to 61.1 in July, its strongest pace since April 2024, reflecting robust performance across services & manufacturing. :contentReference[oaicite:19]{index=19}"
      }
    ]
  },
  {
    "topic": "11. India’s Manufacturing PMI at 16-Month High – July 2025",
    "subtopics": [
      {
        "subtopic": "Industrial sector snapshot",
        "content": "• HSBC Manufacturing PMI hit 59.1 in July—its highest in 16 months—driven by strong output and new orders. :contentReference[oaicite:0]{index=0}\n• Despite rapid growth, business confidence dropped to a 3-year low, highlighting cautious sentiment. :contentReference[oaicite:1]{index=1}"
      }
    ]
  },
  {
    "topic": "12. Retail Inflation at All-Time Low – July 2025",
    "subtopics": [
      {
        "subtopic": "Inflation trends",
        "content": "• Retail CPI inflation is expected to fall to an eight-year low of 1.76% in July. :contentReference[oaicite:2]{index=2}\n• Core inflation (excluding food and fuel) eased to 4.20%, aiding disinflationary trend. :contentReference[oaicite:3]{index=3}\n• Analysts expect further rate cuts in 2025 due to weak domestic demand and prolonged disinflation. :contentReference[oaicite:4]{index=4}"
      }
    ]
  },
  {
    "topic": "13. GST Collections Rise 7.5% YoY – July 2025",
    "subtopics": [
      {
        "subtopic": "Tax revenue data",
        "content": "• Gross GST collections for July reached ₹1.96 lakh crore, up 7.5% YoY. :contentReference[oaicite:5]{index=5}\n• Despite strong gross receipts, net revenue growth was marginal due to a 66.8% surge in refunds. :contentReference[oaicite:6]{index=6}\n• Andhra Pradesh posted a record ₹3,803 cr gross GST in July, a 14% increase YoY. :contentReference[oaicite:7]{index=7}"
      }
    ]
  },
  {
    "topic": "14. Trade Deficit Narrows then Widens – June & July 2025",
    "subtopics": [
      {
        "subtopic": "External trade",
        "content": "• Merchandise trade deficit narrowed to $18.78 bn in June, down from $21.88 bn in May. :contentReference[oaicite:8]{index=8}\n• In Q1 (Apr–June), cumulative deficit was $67.26 bn, up from $62.10 bn YoY. :contentReference[oaicite:9]{index=9}\n• However, July’s trade gap widened again, estimated at $20.7 bn. :contentReference[oaicite:10]{index=10}\n• Services exports grew 17%, remittances up 14% CAGR over 4 years, partially offsetting merchandise trade pressure. :contentReference[oaicite:11]{index=11}"
      }
    ]
  },
  {
    "topic": "15. Equity Mutual Fund Inflows Record ₹42,702 Crore – July 2025",
    "subtopics": [
      {
        "subtopic": "Investment trends",
        "content": "• Net inflows into equity mutual funds surged 81% MoM in July, reaching ₹42,702 crore. :contentReference[oaicite:12]{index=12}\n• SIP inflows hit a record ₹28,464 crore, with 91.1 million active SIP accounts. :contentReference[oaicite:13]{index=13}\n• Total AUM crossed ₹75.36 lakh crore; small-cap funds saw a 61% jump, mid-cap +38%. :contentReference[oaicite:14]{index=14}"
      }
    ]
  },
  {
    "topic": "16. Sensex Lifetime Rise – 100 to 80,000",
    "subtopics": [
      {
        "subtopic": "Stock market milestone",
        "content": "• Since 1979, Sensex has climbed from a base of 100 to around 80,000 in 2025, a near 800x increase. :contentReference[oaicite:15]{index=15}\n• This equates to doubling money roughly every five years — earning its reputation as a wealth creation engine. :contentReference[oaicite:16]{index=16}"
      }
    ]
  },
  {
    "topic": "17. Fiscal Deficit at 17.9% of Target – Q1 FY26",
    "subtopics": [
      {
        "subtopic": "Budget health",
        "content": "• India’s fiscal deficit for April–June 2025 stood at ₹2.80–2.81 lakh crore, or 17.9% of FY26 full-year estimate. :contentReference[oaicite:17]{index=17}"
      }
    ]
  },
  {
    "topic": "18. Manufacturing & Trade Outlook – ICICI Bank",
    "subtopics": [
      {
        "subtopic": "Economic projection",
        "content": "• ICICI Bank projects India's FY26 trade deficit may widen to $300 billion (~7% of GDP), driven by weak non-oil exports despite moderate oil prices. :contentReference[oaicite:18]{index=18}\n• Projected current account deficit around $30 billion (~0.7% of GDP), thanks to resilient services and remittances. :contentReference[oaicite:19]{index=19}"
      }
    ]
  },
  {
    "topic": "19. FDI Inflows Cross $50 Billion – FY 2024–25",
    "subtopics": [
      {
        "subtopic": "Foreign investments",
        "content": "• FDI inflows in FY 2024–25 exceeded $50 billion — a 13% increase over the previous year. :contentReference[oaicite:20]{index=20}\n• However, net FDI contracted sharply in May 2025—dropping 98.2% YoY to just $40 million. :contentReference[oaicite:21]{index=21}"
      }
    ]
  },
  {
    "topic": "20. CPI Food vs Rural Inflation Trends",
    "subtopics": [
      {
        "subtopic": "Inflation breakdown",
        "content": "• Headline CPI inflation in June was 1.72%, down from 2.59% in May. :contentReference[oaicite:22]{index=22}\n• Rural food inflation was negative at –0.92%, sharply lower than last month. :contentReference[oaicite:23]{index=23}"
      }
    ]
  },
  {
    "topic": "21. India’s Mutual Fund Assets Cross Milestone – July 2025",
    "subtopics": [
      {
        "subtopic": "Mutual fund industry update",
        "content": "• Industry AUM reported a new milestone in July 2025, reflecting sustained retail and institutional inflows.\n• Systematic Investment Plan (SIP) contributions continued to be a key driver of net inflows for the month.\n• Asset growth was broad-based across equity, hybrid and debt segments, with retail participation remaining strong.\n• Fund houses highlighted higher allocations to large-cap funds and increased interest in thematic and ESG strategies."
      }
    ]
  },
  {
    "topic": "22. RBI Tightens KYC & Customer Due Diligence Norms – July 2025",
    "subtopics": [
      {
        "subtopic": "Regulatory update for onboarding and risk management",
        "content": "• RBI issued updated KYC guidelines in July 2025 tightening verification for high-risk and cross-border customers.\n• Banks were instructed to enhance digital KYC controls, strengthen periodic re-KYC and monitor suspicious activity more closely.\n• The update emphasised stricter verification for certain corporate and non-resident accounts and clearer audit trails.\n• Industry bodies were asked to implement changes within defined timelines and report implementation progress to regulators."
      }
    ]
  },
  {
    "topic": "23. Corporate Tax Receipts Improve in Monthly Account – July 2025",
    "subtopics": [
      {
        "subtopic": "Government receipts and fiscal flow",
        "content": "• Monthly corporate tax collections showed an uptick in July 2025 compared with recent months, helping improve short-term revenue momentum.\n• The increase reflected improved corporate payouts and some one-off settlements recorded during the month.\n• Officials noted stronger compliance measures and electronic filing efficiencies contributed to timelier collections.\n• Analysts cautioned that corporate receipts can be lumpy and recommended monitoring quarterly trends for a clearer fiscal picture."
      }
    ]
  },
  {
    "topic": "24. RBI Launches UPI Lite Expansion – July 2025",
    "subtopics": [
      {
        "subtopic": "Payments infrastructure update",
        "content": "• RBI announced broader roll-out measures for the UPI Lite product to deepen small-value digital payments.\n• The expansion targeted offline-capable and low-data users to improve financial inclusion in tier-2/3 towns.\n• Several banks and third-party PSPs were invited to enable UPI Lite rails and integrate optional wallet-like features.\n• Pilot feedback indicated faster transaction experience and lower friction for micro-payments at merchants."
      }
    ]
  },
  {
    "topic": "25. Insurance Penetration Trends – July 2025",
    "subtopics": [
      {
        "subtopic": "Insurance market snapshot",
        "content": "• IRDAI reported improving insurance penetration metrics in July 2025 driven by renewed product launches and digital distribution.\n• Life and non-life insurers expanded digital onboarding and instant policy issuance for standard covers.\n• Micro-insurance and rural-focused plans saw targeted marketing drives and tie-ups with fintech/BC networks.\n• Regulators emphasised customer education and simpler grievance redress for growing retail adoption."
      }
    ]
  },
  {
    "topic": "26. RBI Licenses New Payment Bank Entrants – July 2025",
    "subtopics": [
      {
        "subtopic": "Payments sector licensing update",
        "content": "• RBI granted in-principle approvals to new payment bank candidates in July 2025 to widen last-mile digital payment access.\n• The approvals came with strict capital, governance and technology readiness conditions to be satisfied before operations.\n• The regulator emphasised interoperable infrastructure and robust cybersecurity measures for licensees.\n• Market participants expected increased competition in small-ticket savings and retail payments following onboarding."
      }
    ]
  },
  {
    "topic": "27. Export Credit Guarantee Scheme Revisions – July 2025",
    "subtopics": [
      {
        "subtopic": "Support for exporters",
        "content": "• ECGC revised certain scheme parameters in July 2025 to improve coverage and faster claims settlement for exporters.\n• Changes included streamlined documentation, expanded product categories and targeted support for MSME exporters.\n• The objective was to bolster competitiveness amid volatile global demand and supply-chain shifts.\n• Export promotion agencies and trade bodies welcomed the measures, seeking further outreach and awareness drives."
      }
    ]
  },
  {
    "topic": "28. RBI Issues Digital Lending Norms – July 2025",
    "subtopics": [
      {
        "subtopic": "Consumer protection and platform governance",
        "content": "• RBI released a framework for digital lending platforms to address pricing transparency, grievance redress and data handling.\n• Lenders and aggregator platforms were required to disclose full loan costs, sanctions and penalty clauses up front.\n• The norms mandated stronger outsourcing controls, periodic audits, and caps on certain fees for small-value loans.\n• The regulator emphasised borrower education, easier access to dispute resolution, and regular supervisory checks."
      }
    ]
  },
  {
    "topic": "29. Trade Balance Developments – July 2025",
    "subtopics": [
      {
        "subtopic": "Merchandise & services trade snapshot",
        "content": "• Trade data in July 2025 showed mixed signals with export volumes improving in some goods categories while imports remained steady.\n• Services exports and remittances continued to provide an offset to merchandise trade pressures.\n• Policymakers highlighted the need to ramp up value-added exports and diversify markets for sustainable trade balances.\n• Logistics bottlenecks and commodity price swings were noted as near-term headwinds to trade stability."
      }
    ]
  },
  {
    "topic": "30. Cash Reserve & Liquidity Measures – July 2025",
    "subtopics": [
      {
        "subtopic": "Monetary operations and liquidity management",
        "content": "• RBI implemented targeted liquidity operations and repo/reverse repo adjustments in July 2025 to manage systemic liquidity.\n• The central bank used fine-tuning operations and variable-rate repos to smooth market repo rates and support credit flow.\n• Treasury and market participants reported comfortable system liquidity with active participation in LAF and MSF windows.\n• RBI reiterated commitment to price stability while ensuring adequate liquidity for economic activity."
      }
    ]
  },
  {
    "topic": "31. India’s Manufacturing PMI Reaches Multi-Year High – July 2025",
    "subtopics": [
      {
        "subtopic": "Industrial expansion",
        "content": "• HSBC Flash India Manufacturing PMI climbed to 59.2 in July, the highest in nearly 17½ years, fueled by robust domestic and global demand. :contentReference[oaicite:0]{index=0}\n• S&P Global data confirmed a sharp uptick in new orders and production activity. :contentReference[oaicite:1]{index=1}\n• Despite strong activity, business confidence flagged due to cost pressures and competition. :contentReference[oaicite:2]{index=2}"
      }
    ]
  },
  {
    "topic": "32. India’s Composite PMI at 15-Month High – July 2025",
    "subtopics": [
      {
        "subtopic": "Combined private sector outlook",
        "content": "• HSBC Composite PMI (manufacturing + services) edged up to 61.1 in July—the strongest since April 2024—driven by higher new orders and broad demand. :contentReference[oaicite:3]{index=3}\n• Signals sustained momentum across India’s private sector. :contentReference[oaicite:4]{index=4}"
      }
    ]
  },
  {
    "topic": "33. Retail Inflation Hits 8-Year Low – July 2025",
    "subtopics": [
      {
        "subtopic": "Disinflation trend",
        "content": "• Reuters economists’ poll projected CPI inflation at a record low of 1.76%, the lowest in 8 years, driven by subdued food prices. :contentReference[oaicite:5]{index=5}\n• Forecasts from Mint and others estimated inflation between 1.1–1.8%, likely the lowest since 2014. :contentReference[oaicite:6]{index=6}\n• Core CPI was estimated to ease to 4.20%, offering RBI flexibility. :contentReference[oaicite:7]{index=7}"
      }
    ]
  },
  {
    "topic": "34. Equity Mutual Fund Inflows Soar to Record ₹42,702 Cr – July 2025",
    "subtopics": [
      {
        "subtopic": "Investor confidence surge",
        "content": "• Equity (including hybrid) mutual fund net inflows jumped 81% MoM to ₹42,702 crore in July. :contentReference[oaicite:8]{index=8}\n• Record SIP contribution of ₹28,464 crore and AUM crossed ₹75.36 lakh crore. :contentReference[oaicite:9]{index=9}\n• Small- and mid-cap fund inflows surged 61% and 38%, respectively; large-cap funds rose 25%. Gold and silver ETFs also attracted ₹1,256 crore and ₹19,040 crore, respectively. :contentReference[oaicite:10]{index=10}"
      }
    ]
  },
  {
    "topic": "35. Mutual Fund Industry AUM Touches ₹75.36 Lakh Crore – July 2025",
    "subtopics": [
      {
        "subtopic": "Systematic growth",
        "content": "• Total mutual fund AUM rose to ₹75.36 lakh crore, up from ₹74.40 lakh crore in June. :contentReference[oaicite:11]{index=11}\n• SIP book value reached ₹15.19 lakh crore with 91.1 million active SIP accounts. :contentReference[oaicite:12]{index=12}\n• Retail investors accounted for roughly 27% of AUM, with HNIs holding about 34%, comprising over 61% of total assets. :contentReference[oaicite:13]{index=13}"
      }
    ]
  },
  {
    "topic": "36. Passive Funds Capture 17% Market Share – June 2025",
    "subtopics": [
      {
        "subtopic": "Shift in investor preference",
        "content": "• Passive (index) funds now represent 17% of mutual fund AUM, reflecting growing investor interest in low-cost, broad-market vehicles. :contentReference[oaicite:14]{index=14}"
      }
    ]
  },
  {
    "topic": "37. FDI Inflows Exceed $50 Billion in FY 2024–25",
    "subtopics": [
      {
        "subtopic": "Foreign investment trend",
        "content": "• India attracted over USD 50 billion in FDI in FY 2024–25, marking a 13% rise over the previous year. :contentReference[oaicite:15]{index=15}"
      }
    ]
  },
  {
    "topic": "38. Retail CBDC Expansion: Phase-2 Cities Named",
    "subtopics": [
      {
        "subtopic": "Digital rupee rollout",
        "content": "• RBI expanded its retail digital rupee pilot to nine more cities beyond the initial four: Ahmedabad, Gangtok, Guwahati, Hyderabad, Indore, Kochi, Lucknow, Patna, and Shimla. :contentReference[oaicite:16]{index=16}"
      }
    ]
  },
  {
    "topic": "39. RBI Holds Rates Steady at 5.5% Amid Easing Inflation",
    "subtopics": [
      {
        "subtopic": "Monetary policy decision",
        "content": "• RBI’s August 2025 monetary policy kept the repo rate at 5.5% after three consecutive cuts, citing disinflation and a balanced outlook for growth and price stability. :contentReference[oaicite:17]{index=17}\n• Analysts suggest the easing cycle may be over amid falling inflation and narrowing real rate gap. :contentReference[oaicite:18]{index=18}"
      }
    ]
  },
  {
    "topic": "40. RBI Considers Final Phase of Easing Cycle",
    "subtopics": [
      {
        "subtopic": "Rate outlook",
        "content": "• Analysts believe RBI’s recent pause at 5.5% may signal the end of its easing cycle. Persistent inflation concerns and weaker domestic growth indicators reduce scope for further cuts. :contentReference[oaicite:19]{index=19}"
      }
    ]
  },
  {
    "topic": "41. Henley Passport Index 2025",
    "subtopics": [
      {
        "subtopic": "India's global mobility ranking",
        "content": "• India's rank in July 2025: 77th, an improvement of 8 places from the previous year.\n• Top rank: Singapore.\n• Indian passport holders now have access to 59 countries either visa-free or with visa-on-arrival entry.\n• Released by Henley & Partners, this index is considered a key indicator of a country's global mobility and diplomatic strength."
      }
    ]
  },
  {
    "topic": "42. Human Development Report (HDR) 2025",
    "subtopics": [
      {
        "subtopic": "UNDP's human development assessment",
        "content": "• India's rank: 130th out of 193 countries.\n• Top rank: Iceland.\n• Report title: \"A Matter of Choice: People and Possibilities in the Age of AI.\"\n• India's Human Development Index (HDI) value showed a marginal increase.\n• India remains in the \"medium human development\" category.\n• Released annually by the United Nations Development Programme (UNDP)."
      }
    ]
  },
  {
    "topic": "43. Global Innovation Index (GII) 2025",
    "subtopics": [
      {
        "subtopic": "Innovation performance ranking",
        "content": "• India's rank: 42nd in 2025, down from 40th in 2024.\n• Top rank: Switzerland (based on previous years' trend as 2025 data not explicitly stated).\n• Published by the World Intellectual Property Organization (WIPO).\n• Measures innovation performance across indicators such as R&D spending, patent filings, and creative outputs."
      }
    ]
  },
  {
    "topic": "44. Global Hunger Index (GHI) 2024",
    "subtopics": [
      {
        "subtopic": "Hunger and malnutrition assessment",
        "content": "• India's rank: 105th out of 127 countries.\n• Score: 27.3 — classified as \"serious\" level of hunger.\n• Top rank: Not applicable, multiple countries share the top spot.\n• Measures: undernourishment, child stunting, child wasting, and child mortality.\n• Although released in late 2024, remains relevant for 2025 current affairs."
      }
    ]
  },
  {
    "topic": "45. Ease of Doing Business Index",
    "subtopics": [
      {
        "subtopic": "Status of ranking",
        "content": "• India's rank: Not applicable for 2025.\n• Top rank: Not applicable.\n• The World Bank discontinued the Ease of Doing Business report in 2021 due to data irregularities.\n• No new official rankings are published for this index."
      }
    ]
  }
]
