[
  {
    "topic": "1. SBI Signs MoU with Mastercard for Digital Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and Mastercard sign MoU in July",
        "content": "• State Bank of India signed an MoU with Mastercard in July 2025 to enhance digital payment solutions."
      }
    ]
  },
  {
    "topic": "2. RBI Signs Agreement with IMF for Financial Stability – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and IMF agreement in July",
        "content": "• RBI signed an agreement with IMF in July 2025 to strengthen financial stability frameworks."
      }
    ]
  },
  {
    "topic": "3. HDFC Bank MoU with NPCI for UPI Expansion – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and NPCI sign MoU in July",
        "content": "• HDFC Bank signed an MoU with NPCI in July 2025 to expand UPI services."
      }
    ]
  },
  {
    "topic": "4. Axis Bank Agreement with Google Pay for Digital Lending – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and Google Pay agreement in July",
        "content": "• Axis Bank signed an agreement with Google Pay in July 2025 to launch digital lending products."
      }
    ]
  },
  {
    "topic": "5. ICICI Bank MoU with Tata Consultancy for AI Solutions – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and TCS sign MoU in July",
        "content": "• ICICI Bank signed an MoU with Tata Consultancy Services in July 2025 for AI-based banking solutions."
      }
    ]
  },
  {
    "topic": "6. LIC Agreement with IRDAI for Insurance Penetration – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and IRDAI agreement in July",
        "content": "• LIC signed an agreement with IRDAI in July 2025 to improve insurance penetration in rural areas."
      }
    ]
  },
  {
    "topic": "7. SBI MoU with Amazon Pay for E-commerce Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and Amazon Pay sign MoU in July",
        "content": "• SBI signed an MoU with Amazon Pay in July 2025 to facilitate e-commerce payments."
      }
    ]
  },
  {
    "topic": "8. RBI Agreement with World Bank for Financial Inclusion – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and World Bank agreement in July",
        "content": "• RBI signed an agreement with World Bank in July 2025 to promote financial inclusion initiatives."
      }
    ]
  },
  {
    "topic": "9. Paytm MoU with Visa for International Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "Paytm and Visa sign MoU in July",
        "content": "• Paytm signed an MoU with Visa in July 2025 to enable international payment services."
      }
    ]
  },
  {
    "topic": "10. RBI Agreement with BIS for Regulatory Cooperation – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and BIS agreement in July",
        "content": "• RBI signed an agreement with Bank for International Settlements in July 2025 for regulatory cooperation."
      }
    ]
  },
  {
    "topic": "11. SBI MoU with Flipkart for Digital Commerce – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and Flipkart sign MoU in July",
        "content": "• SBI signed an MoU with Flipkart in July 2025 to boost digital commerce payments."
      }
    ]
  },
  {
    "topic": "12. RBI Agreement with ADB for Infrastructure Finance – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and ADB agreement in July",
        "content": "• RBI signed an agreement with Asian Development Bank in July 2025 for infrastructure finance projects."
      }
    ]
  },
  {
    "topic": "13. HDFC Bank MoU with Microsoft for Cloud Banking – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and Microsoft sign MoU in July",
        "content": "• HDFC Bank signed an MoU with Microsoft in July 2025 to implement cloud banking solutions."
      }
    ]
  },
  {
    "topic": "14. Axis Bank Agreement with Facebook Pay for Social Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and Facebook Pay agreement in July",
        "content": "• Axis Bank signed an agreement with Facebook Pay in July 2025 to launch social payment features."
      }
    ]
  },
  {
    "topic": "15. ICICI Bank MoU with Infosys for Blockchain Solutions – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and Infosys sign MoU in July",
        "content": "• ICICI Bank signed an MoU with Infosys in July 2025 for blockchain-based banking solutions."
      }
    ]
  },
  {
    "topic": "16. LIC Agreement with SBI for Bancassurance – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and SBI agreement in July",
        "content": "• LIC signed an agreement with SBI in July 2025 to expand bancassurance services."
      }
    ]
  },
  {
    "topic": "17. RBI Agreement with OECD for Policy Research – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and OECD agreement in July",
        "content": "• RBI signed an agreement with OECD in July 2025 for joint policy research."
      }
    ]
  },
  {
    "topic": "18. SBI MoU with Google Cloud for Data Analytics – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and Google Cloud sign MoU in July",
        "content": "• SBI signed an MoU with Google Cloud in July 2025 to enhance data analytics capabilities."
      }
    ]
  },
  {
    "topic": "19. Paytm Agreement with NPCI for RuPay Integration – July 2025",
    "subtopics": [
      {
        "subtopic": "Paytm and NPCI agreement in July",
        "content": "• Paytm signed an agreement with NPCI in July 2025 to integrate RuPay cards on its platform."
      }
    ]
  },
  {
    "topic": "20. RBI Agreement with UNDP for Sustainable Finance – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and UNDP agreement in July",
        "content": "• RBI signed an agreement with UNDP in July 2025 to promote sustainable finance initiatives."
      }
    ]
  },
  {
    "topic": "21. RBI Agreement with European Central Bank for Regulatory Exchange – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and ECB agreement in July",
        "content": "• RBI signed an agreement with European Central Bank in July 2025 for regulatory information exchange."
      }
    ]
  },
  {
    "topic": "22. SBI MoU with PayPal for Cross-border Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and PayPal sign MoU in July",
        "content": "• SBI signed an MoU with PayPal in July 2025 to facilitate cross-border transactions."
      }
    ]
  },
  {
    "topic": "23. HDFC Bank Agreement with Amazon Web Services for Cloud Migration – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and AWS agreement in July",
        "content": "• HDFC Bank signed an agreement with AWS in July 2025 for cloud migration of banking services."
      }
    ]
  },
  {
    "topic": "24. Axis Bank MoU with Samsung Pay for Mobile Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and Samsung Pay sign MoU in July",
        "content": "• Axis Bank signed an MoU with Samsung Pay in July 2025 to expand mobile payment options."
      }
    ]
  },
  {
    "topic": "25. ICICI Bank Agreement with Oracle for Core Banking Solutions – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and Oracle agreement in July",
        "content": "• ICICI Bank signed an agreement with Oracle in July 2025 for core banking technology upgrades."
      }
    ]
  },
  {
    "topic": "26. LIC MoU with UNICEF for Financial Literacy – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and UNICEF sign MoU in July",
        "content": "• LIC signed an MoU with UNICEF in July 2025 to promote financial literacy among children."
      }
    ]
  },
  {
    "topic": "27. RBI Agreement with S&P Global for Credit Rating Collaboration – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and S&P Global agreement in July",
        "content": "• RBI signed an agreement with S&P Global in July 2025 for credit rating collaboration."
      }
    ]
  },
  {
    "topic": "28. SBI MoU with Tata Motors for Vehicle Financing – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and Tata Motors sign MoU in July",
        "content": "• SBI signed an MoU with Tata Motors in July 2025 to offer vehicle financing solutions."
      }
    ]
  },
  {
    "topic": "29. Paytm Agreement with Airtel Payments Bank for Wallet Integration – July 2025",
    "subtopics": [
      {
        "subtopic": "Paytm and Airtel Payments Bank agreement in July",
        "content": "• Paytm signed an agreement with Airtel Payments Bank in July 2025 for wallet integration."
      }
    ]
  },
  {
    "topic": "30. RBI Agreement with FICCI for MSME Support – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and FICCI agreement in July",
        "content": "• RBI signed an agreement with FICCI in July 2025 to support MSME sector growth."
      }
    ]
  },
  {
    "topic": "31. HDFC Bank MoU with Google for AI Research – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and Google sign MoU in July",
        "content": "• HDFC Bank signed an MoU with Google in July 2025 for joint AI research in banking."
      }
    ]
  },
  {
    "topic": "32. Axis Bank Agreement with NPCI for Bharat BillPay Expansion – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and NPCI agreement in July",
        "content": "• Axis Bank signed an agreement with NPCI in July 2025 to expand Bharat BillPay services."
      }
    ]
  },
  {
    "topic": "33. ICICI Bank MoU with IBM for Cybersecurity – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and IBM sign MoU in July",
        "content": "• ICICI Bank signed an MoU with IBM in July 2025 to strengthen cybersecurity measures."
      }
    ]
  },
  {
    "topic": "34. LIC Agreement with Ministry of Finance for Pension Schemes – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and Ministry of Finance agreement in July",
        "content": "• LIC signed an agreement with Ministry of Finance in July 2025 to launch new pension schemes."
      }
    ]
  },
  {
    "topic": "35. RBI Agreement with Moody’s for Economic Research – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and Moody’s agreement in July",
        "content": "• RBI signed an agreement with Moody’s in July 2025 for economic research collaboration."
      }
    ]
  },
  {
    "topic": "36. SBI MoU with Reliance Jio for Digital Banking – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and Reliance Jio sign MoU in July",
        "content": "• SBI signed an MoU with Reliance Jio in July 2025 to offer digital banking services."
      }
    ]
  },
  {
    "topic": "37. HDFC Bank Agreement with PayU for Payment Gateway – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and PayU agreement in July",
        "content": "• HDFC Bank signed an agreement with PayU in July 2025 for payment gateway integration."
      }
    ]
  },
  {
    "topic": "38. Axis Bank MoU with Flipkart for Consumer Finance – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and Flipkart sign MoU in July",
        "content": "• Axis Bank signed an MoU with Flipkart in July 2025 to offer consumer finance products."
      }
    ]
  },
  {
    "topic": "39. ICICI Bank Agreement with Paytm for QR Code Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and Paytm agreement in July",
        "content": "• ICICI Bank signed an agreement with Paytm in July 2025 to enable QR code payments."
      }
    ]
  },
  {
    "topic": "40. LIC MoU with SBI Life for Joint Insurance Products – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and SBI Life sign MoU in July",
        "content": "• LIC signed an MoU with SBI Life in July 2025 to launch joint insurance products."
      }
    ]
  },
  {
    "topic": "41. RBI Agreement with NITI Aayog for Policy Innovation – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and NITI Aayog agreement in July",
        "content": "• RBI signed an agreement with NITI Aayog in July 2025 for policy innovation in finance."
      }
    ]
  },
  {
    "topic": "42. SBI MoU with PhonePe for UPI Integration – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and PhonePe sign MoU in July",
        "content": "• SBI signed an MoU with PhonePe in July 2025 to integrate UPI services."
      }
    ]
  },
  {
    "topic": "43. HDFC Bank Agreement with Razorpay for Merchant Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and Razorpay agreement in July",
        "content": "• HDFC Bank signed an agreement with Razorpay in July 2025 for merchant payment solutions."
      }
    ]
  },
  {
    "topic": "44. Axis Bank MoU with BharatPe for SME Lending – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and BharatPe sign MoU in July",
        "content": "• Axis Bank signed an MoU with BharatPe in July 2025 to offer SME lending products."
      }
    ]
  },
  {
    "topic": "45. ICICI Bank Agreement with PolicyBazaar for Insurance Distribution – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and PolicyBazaar agreement in July",
        "content": "• ICICI Bank signed an agreement with PolicyBazaar in July 2025 for insurance product distribution."
      }
    ]
  },
  {
    "topic": "46. LIC MoU with Groww for Investment Products – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and Groww sign MoU in July",
        "content": "• LIC signed an MoU with Groww in July 2025 to offer investment products."
      }
    ]
  },
  {
    "topic": "47. RBI Agreement with SEBI for Market Regulation – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and SEBI agreement in July",
        "content": "• RBI signed an agreement with SEBI in July 2025 for joint market regulation."
      }
    ]
  },
  {
    "topic": "48. SBI MoU with CRED for Credit Card Services – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and CRED sign MoU in July",
        "content": "• SBI signed an MoU with CRED in July 2025 to enhance credit card services."
      }
    ]
  },
  {
    "topic": "49. HDFC Bank Agreement with Zerodha for Investment Platform – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and Zerodha agreement in July",
        "content": "• HDFC Bank signed an agreement with Zerodha in July 2025 to launch an investment platform."
      }
    ]
  },
  {
    "topic": "50. Axis Bank MoU with MobiKwik for Digital Wallets – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and MobiKwik sign MoU in July",
        "content": "• Axis Bank signed an MoU with MobiKwik in July 2025 to expand digital wallet services."
      }
    ]
  },
  {
    "topic": "51. ICICI Bank Agreement with PhonePe for Bill Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and PhonePe agreement in July",
        "content": "• ICICI Bank signed an agreement with PhonePe in July 2025 to enable bill payment services."
      }
    ]
  },
  {
    "topic": "52. LIC MoU with Paytm for Insurance Premium Collection – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and Paytm sign MoU in July",
        "content": "• LIC signed an MoU with Paytm in July 2025 for insurance premium collection."
      }
    ]
  },
  {
    "topic": "53. RBI Agreement with World Economic Forum for Fintech Innovation – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and WEF agreement in July",
        "content": "• RBI signed an agreement with World Economic Forum in July 2025 for fintech innovation."
      }
    ]
  },
  {
    "topic": "54. SBI MoU with Google Pay for Merchant Onboarding – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and Google Pay sign MoU in July",
        "content": "• SBI signed an MoU with Google Pay in July 2025 to onboard merchants for digital payments."
      }
    ]
  },
  {
    "topic": "55. HDFC Bank Agreement with Facebook for Social Commerce – July 2025",
    "subtopics": [
      {
        "subtopic": "HDFC Bank and Facebook agreement in July",
        "content": "• HDFC Bank signed an agreement with Facebook in July 2025 to launch social commerce features."
      }
    ]
  },
  {
    "topic": "56. Axis Bank MoU with Amazon for E-commerce Financing – July 2025",
    "subtopics": [
      {
        "subtopic": "Axis Bank and Amazon sign MoU in July",
        "content": "• Axis Bank signed an MoU with Amazon in July 2025 to offer e-commerce financing solutions."
      }
    ]
  },
  {
    "topic": "57. ICICI Bank Agreement with Groww for Mutual Fund Distribution – July 2025",
    "subtopics": [
      {
        "subtopic": "ICICI Bank and Groww agreement in July",
        "content": "• ICICI Bank signed an agreement with Groww in July 2025 for mutual fund distribution."
      }
    ]
  },
  {
    "topic": "58. LIC MoU with Razorpay for Online Premium Payments – July 2025",
    "subtopics": [
      {
        "subtopic": "LIC and Razorpay sign MoU in July",
        "content": "• LIC signed an MoU with Razorpay in July 2025 to enable online premium payments."
      }
    ]
  },
  {
    "topic": "59. RBI Agreement with UNIDO for MSME Development – July 2025",
    "subtopics": [
      {
        "subtopic": "RBI and UNIDO agreement in July",
        "content": "• RBI signed an agreement with UNIDO in July 2025 for MSME development programs."
      }
    ]
  },
  {
    "topic": "60. SBI MoU with BharatPe for Digital Lending – July 2025",
    "subtopics": [
      {
        "subtopic": "SBI and BharatPe sign MoU in July",
        "content": "• SBI signed an MoU with BharatPe in July 2025 to launch digital lending products."
      }
    ]
  }
]
